Autodesk.Revit.DB.CurveLoop.CreateViaOffset(Autodesk.Revit.DB.CurveLoop,System.Double,Autodesk.Revit.DB.XYZ)
Creates a new curve loop that is an offset of the existing curve loop.
Remarks:
For each curve in the curve loop, the offset curve is theoretically defined by translating every point of the original curve by the
vector offsetDist * (curveTan x normal) where curveTan is the curve's unit tangent vector at the given point. The curves are then
trimmed to create a continuous curve loop.  For a planar curve loop, this amounts to pushing each point "to the right" of the curve
loop by the signed offset distance offsetDist, within the plane of the curve loop. The "right" side of the curve loop at a given
point on the curve loop is defined with reference to normal being thought of as the upward direction and curveTan being thought of
as the forward direction, as if you are walking along the curve loop. It follows that if offsetDist is positive, points will be
offset to the right of the curve loop, whereas if offsetDist is negative, points will be offset to the left of the curve loop.
original:
The original curve loop.
offsetDist:
The signed offset distance.
normal:
The normal of the offset plane.
Returns:
The offset curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the curve loop could not be offset.
Since:
2015

Autodesk.Revit.DB.CurveLoop.CreateViaThicken(Autodesk.Revit.DB.CurveLoop,System.Double,Autodesk.Revit.DB.XYZ)
Creates a new closed curve loop by thickening the input open curve loop with respect to a given plane.
Remarks:
The new loop will be created via
offsets of the input curve loop (in the plane of the normal vector) with the endpoints
connected with lines.The original curve loop will be at the center of the new loop.
curveLoop:
The input curve.
thickness:
The distance between the offset curves created on either side of the input curve.
normal:
The normal vector to the plane used for thickening.
Returns:
The new curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the curve loop is not marked as open.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for thickness must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the input curve could not be thickened.
Since:
2015

Autodesk.Revit.DB.CurveLoop.CreateViaThicken(Autodesk.Revit.DB.Curve,System.Double,Autodesk.Revit.DB.XYZ)
Creates a new closed curve loop by thickening the input curve with respect to a given plane.
Remarks:
The new loop will be created via
offsets of the input curve (in the plane of the normal vector) with the endpoints
connected with lines.The original curve will be at the center of the new loop.
pCurve:
The input curve.
thickness:
The distance between the offset curves created on either side of the input curve.
normal:
The normal vector to the plane used for thickening.
Returns:
The new curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input pCurve points to a helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for thickness must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Throws if the input curve could not be thickened.
Since:
2012

Autodesk.Revit.DB.CurveLoop.Create(System.Collections.Generic.IList`1{Autodesk.Revit.DB.Curve})
Creates a new curve loop.
curves:
The curves.
Returns:
The curve loop.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves contains at least one helical curve and is not supported for this operation.
-or-
Throws if the input curves are not contiguous.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.CurveLoop.GetCurveLoopIterator
Returns a curve that iterates through the curve loop.
Returns: A curve loop iterator object that can be used to iterate through key-value pairs in the collection.
Since:
2013

Autodesk.Revit.DB.CurveLoop.GetEnumerator
Returns an enumerator that iterates through the curve loop.
Returns: An IEnumerator(Curve) object that can be used to iterate through key-value pairs in the collection.
Since:
2013

Autodesk.Revit.DB.CurveLoop
A class that represents a chain of curves.
Remarks:
There are a specific set of requirements for how valid CurveLoops must be formed:
The curves must typically be continuous.It may be either closed (where the start and end points coincide) or open.There should be no self-intersections.
A CurveLoop is said to be "continuous" if either:
the loop contains at most one curvethe end of each curve coincides with the start of the next one (if there is a next curve).
Many geometry utilities require CurveLoops to be continuous, but discontinuous CurveLoops are sometimes used. For example, the curves
in a continuous CurveLoop may be offset, resulting in a discontinuous loop if the offset curves overlap or do not meet, and the offset
curves might then be extended or trimmed to form a continuous CurveLoop.
A CurveLoop is said to be "closed" if it is non-empty, continuous, and if either:
the loop contains just one curve, which is unbounded and periodicthe loop's end point coincides with its start point
For example, a CurveLoop comprising four lines forming a rectangle, listed in order around the rectangle, with each curve oriented in direction
in which the curves are listed is closed. As another example, a CurveLoop consisting of just one unbounded circle is closed.
A CurveLoop is said to be "open" if it is not closed. For example, a CurveLoop consisting of a single line is open, as is the "offset CurveLoop"
mentioned above. Note that an open CurveLoop may be continuous or discontinuous, and a continuous CurveLoop may be open or closed. The definitions
imply that a discontinuous CurveLoop is necessarily open and an empty CurveLoop is open.
It should also be noted that these definitions take the order of the curves and the curves' directions into account. For example, a CurveLoop
comprising the four edges of a rectangle in the order {bottom, top, left, right} is discontinuous. Similarly, a CurveLoop comprising the four
edges of a rectangle in the order {bottom, right, top, left}, with three of the lines oriented in the counter-clockwise direction of
the rectangle and the fourth oriented in the clockwise direction, is discontinuous.
Finally, note that some routines in Revit may set the CurveLoop to be marked "open" or "closed" in spite of the actual geometry of the curves.
In these special cases, the CurveLoop class does not require that the CurveLoop is correctly marked.
In the API, the members of the CurveLoop may be directly iterated, as the class implements IEnumerable<Curve>.
Since:
2012